<template>
  <div class="columnCenter">
    <div class="title">《米汤姐的相馆》隐私声明</div>
    <div class="textArea cloumn">
      <div class="licenceText">{{text}}</div>
    </div>
  </div>
</template>

<script>
import Donate from '@/components/Donate';
import AppList from '@/components/AppList';
import router from '@/router';

export default {
  components: {
    Donate,
    AppList
  },
  data() {
    return {
        text: `米汤姐的相馆尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更有个性化的服务，米汤姐的相馆会按照本隐私权政策的规定使用和披露您的个人信息。但米汤姐的相馆将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，米汤姐的相馆不会将这些信息对外披露或向第三方提供。米汤姐的相馆会不时更新本隐私权政策。 您在同意米汤姐的相馆服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私权政策属于米汤姐的相馆服务使用协议不可分割的一部分。 

1. 适用范围 
a) 在您反馈建议时，会收集你的联系方式，设备信息以及系统版本信息；

2. 信息使用 
a) 米汤姐的相馆不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可。
b) 米汤姐的相馆亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。
c) 为让新版本有更好的体验的目的，米汤姐的相馆可能通过使用您留下的联系方式联系你，交流具体的优化方案。

3. 信息披露 
在如下情况下，米汤姐的相馆将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息： 
a) 经您事先同意，向第三方披露； 
b) 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；
c) 如您出现违反中国有关法律、法规或者米汤姐的相馆服务协议或相关规则的情况，需要向第三方披露；  
d) 如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；
e) 其它米汤姐的相馆根据法律、法规或者网站政策认为合适的披露。  

4. 信息安全
米汤姐的相馆收集的有关您的信息和资料将保存在腾讯吐了槽的服务器上，这些信息和资料仅可被米汤姐的相馆相关人员看到。`
    }
  },
  methods: {
    logoTap() {
      router.push('home')
    }
  }
}
</script>

<style scoped>
</style>
